---
kind: type
id: T:Autodesk.Revit.DB.ClassificationEntry
source: html/11e0e748-358f-47f7-565d-e2e848d97fe8.htm
---
# Autodesk.Revit.DB.ClassificationEntry

Represents an entry in the classification table.

## Syntax (C#)
```csharp
public class ClassificationEntry : KeyBasedTreeEntry
```